{
  "titleFailureMessage": "Oops! something happened here.",
  "shortMessageFailure": "Huff, there's a small hiccup. No need to worry, we'll fix it in a jiffy!",
  "dataNotFoundFailure": "Data not found. Please check your data sources or contact support for further assistance.",
  "requestCancelledFailure": "The request was cancelled due to an unexpected event. Please try again later or contact support for assistance.",
  "unauthorisedRequestFailure": "The request is not authorized. Please check your credentials or contact support for further assistance.",
  "badRequestFailure": "The request is invalid. Please ensure that you provide valid data and try again.",
  "notFoundFailure": "The requested resource was not found. Please verify the URL or contact support for further assistance.",
  "methodNotAllowedFailure": "The requested method is not allowed for this resource. Please check the API documentation or contact support for further assistance.",
  "notAcceptableFailure": "The request is not acceptable. Please review the request parameters or contact support for further assistance.",
  "requestTimeoutFailure": "The request timed out. Please try again later or contact support if the issue persists.",
  "sendTimeoutFailure": "The send operation timed out. Please try again later or contact support if the issue persists.",
  "conflictFailure": "A conflict occurred while processing the request. Please try again later or contact support for further assistance.",
  "internalServerErrorFailure": "It seems that the server is not reachable at the moment. Please try again later. Should the issue persist, please reach out to the developer at piknikaja@gmail.com.",
  "notImplementedFailure": "The request is not implemented. Please contact support for further assistance.",
  "serviceUnavailableFailure": "The service is temporarily unavailable. Please try again later or contact support if the issue persists.",
  "noInternetConnectionFailure": "It seems that your device is not connected to the internet. Please check your network connection and try again.",
  "formatFailure": "A format error occurred while processing the request. Please ensure that the data format is correct and try again.",
  "unableToProcessFailure": "The request cannot be processed at the moment. Please try again later or contact support if the issue persists.",
  "otherErrorFailure": "An unknown error occurred. Please contact support for further assistance.",
  "unexpectedFailure": "An unexpected error occurred. Please try again later or contact support if the issue persists.",
  "forbiddenErrorFailure": "Access is forbidden. You don't have the necessary permissions to access this resource. Please contact support for further assistance.",
  "badCertificateFailure": "The certificate is invalid or expired. Please ensure that the certificate is up to date or contact support for further assistance.",
  "tooManyAttemptRequestFailure": "Too many request attempted right now. Please try again later.",
  "unableToOpenGoogleMapsFailure": "Could not open the map. Please ensure you have google maps installed on your system and have atleast web browser.",
  "locationPermissionDeniedFailure": "Oops, location not permitted. Please grant permission to enjoy the provided features.",
  "locationPermissionDisabledFailure": "Oops, location services unavailable. Please enable them to enjoy the provided features.",
  "invalidLoginCredentialsFailure": "Oops, location services unavailable. Please enable them to enjoy the provided features.",
  "invalidRegisterPhraseFailure": "Oops, location services unavailable. Please enable them to enjoy the provided features."
}
