{
  "titleFailureMessage": "Ups, ada sesuatu.",
  "shortMessageFailure": "Ups, ada hambatan kecil. Tidak perlu khawatir, akan segera diperbaiki!",
  "dataNotFoundFailure": "Data tidak ditemukan. Harap periksa sumber data atau hubungi customer service untuk bantuan lebih lanjut.",
  "requestCancelledFailure": "Permintaan dibatalkan karena peristiwa yang tidak terduga. Harap coba lagi nanti atau hubungi customer service untuk bantuan.",
  "unauthorisedRequestFailure": "Permintaan tidak diizinkan. Harap periksa kredensial Anda atau hubungi customer service untuk bantuan lebih lanjut.",
  "badRequestFailure": "Permintaan tidak valid. Pastikan Anda memberikan data yang valid dan coba lagi.",
  "notFoundFailure": "Sumber daya yang diminta tidak ditemukan. Harap verifikasi URL atau hubungi customer service untuk bantuan lebih lanjut.",
  "methodNotAllowedFailure": "Metode yang diminta tidak diizinkan untuk sumber daya ini. Harap periksa dokumentasi API atau hubungi customer service untuk bantuan lebih lanjut.",
  "notAcceptableFailure": "Permintaan tidak dapat diterima. Harap tinjau parameter permintaan atau hubungi customer service untuk bantuan lebih lanjut.",
  "requestTimeoutFailure": "Waktu permintaan habis. Harap coba lagi nanti atau hubungi customer service jika masalah berlanjut.",
  "sendTimeoutFailure": "Operasi pengiriman habis waktu. Harap coba lagi nanti atau hubungi customer service jika masalah berlanjut.",
  "conflictFailure": "Konflik terjadi saat memproses permintaan. Harap coba lagi nanti atau hubungi customer service untuk bantuan lebih lanjut.",
  "internalServerErrorFailure": "Sepertinya server tidak dapat dijangkau saat ini. Harap coba lagi nanti. Jika masalah berlanjut, hubungi pengembang di piknikaja@gmail.com.",
  "notImplementedFailure": "Permintaan belum diimplementasikan. Harap hubungi customer service untuk bantuan lebih lanjut.",
  "serviceUnavailableFailure": "Layanan sementara tidak tersedia. Harap coba lagi nanti atau hubungi customer service jika masalah berlanjut.",
  "noInternetConnectionFailure": "Tampaknya perangkat Anda tidak terhubung ke internet. Harap periksa koneksi jaringan Anda dan coba lagi.",
  "formatFailure": "Terjadi kesalahan format saat memproses permintaan. Pastikan format data benar dan coba lagi.",
  "unableToProcessFailure": "Permintaan tidak dapat diproses saat ini. Harap coba lagi nanti atau hubungi customer service jika masalah berlanjut.",
  "otherErrorFailure": "Terjadi kesalahan yang tidak diketahui. Harap hubungi customer service untuk bantuan lebih lanjut.",
  "unexpectedFailure": "Terjadi kesalahan yang tidak terduga. Harap coba lagi nanti atau hubungi customer service jika masalah berlanjut.",
  "forbiddenErrorFailure": "Akses ditolak. Anda tidak memiliki izin yang cukup untuk mengakses sumber daya ini. Harap hubungi customer service untuk bantuan lebih lanjut.",
  "badCertificateFailure": "Sertifikat tidak valid atau kadaluarsa. Pastikan sertifikatnya terbaru atau hubungi customer service untuk bantuan lebih lanjut.",
  "tooManyAttemptRequestFailure": "Terlalu banyak permintaan saat ini. Silahkan coba lagi nanti.",
  "unableToOpenGoogleMapsFailure": "Gak bisa buka peta nihh. Pastikan Google Maps terpasang & ada browser web.",
  "invalidGivenDataFailure": "Pastikan semua data yang di inputkan sudah benar.",
  "locationPermissionDeniedFailure": "Aduhh lokasi tidak diizinkan, tolong izinkan supaya bisa menikmati fitur yang diberikan.",
  "locationPermissionDisabledFailure": "Upss, layanan lokasi tidak ada. tolong aktifkan supaya bisa menikmati fitur yang diberikan.",
  "invalidRegisterPhraseFailure": "Wah, kode recovery kamu ada yang salah! coba cek ulang ya."
}
